InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РасчетыСервер/Ext/Module.bsl
Функция ЦенаПродажи(АктуальнаяДата, ПозицияНоменклатуры) экспорт     
	Отбор = новый структура("Номенклатура", ПозицияНоменклатуры);
	
	ЗначениРесурсов = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	
	Возврат ЗначениРесурсов.Цена;
КонецФункции


Функция ЦенаПродажиЗапросом(АктуальнаяДата, ПозицияНоменклатуры) Экспорт   
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ЦеныСрез.Цена КАК Цена
	 |ИЗ
	 |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК ЦеныСрез";
	
	Запрос.УстановитьПараметр("Дата", АктуальнаяДата);
	Запрос.УстановитьПараметр("Номенклатура", ПозицияНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Цена;
	КонецЕсли;
	
КонецФункции
